<!DOCTYPE html>
<html>
	<head>
		<link rel="stylesheet" type="text/css" href="style.css" >	
			<title>-NG-</title>
	</head>
	<body>
		<?php include('header.php') ?>
		<?php include('menu.php') ?>  

	
			 
			   <div class="content">
			   	 

				<h1><ul><ul>HTML</ul></ul></h1>
					
		<div><ul>HTML ( HyperText Markup Language ) -ը օգտագործվում է կայքէջերի նշագրման համար ։HTML-ի օգնությամբ հեշտությամբ կարելի է ստեղծել համեմատաբար պարզ, սակայն գեղեցիկ ձևավորված փասթաթուղթ։ HTML-ի օգնությամբ հեշտությամբ կարելի է ստեղծել համեմատաբար պարզ, սակայն գեղեցիկ ձևավորված փասթաթուղթ։ Ի հավելումն փասթաթղթի կառուցվածքի պարզեցմանը, HTML-ում աջակցվում էր հիպերտեքստը։ Մուլտիմեդիայի հնարավորությունները ավելացվեցին քիչ ավելի ուշ։ Ի սկզբանե HTML լեզուն ստեղծվել է որպես փասթաթղթերի կառուցման և ձևավորման միջոց՝ անկախ օգտագործվող արտածման միջոցից (էկրան, տպիչ և այլն) ցուցադրելու միջոց։ Նախնական HTML ձևաչափով տեքստը պետք է առանց ոճային և կառուծվածքային ձևափոխման արտածվեր սարքավորման վրա՝ տարբեր տեխնիկական համալրմամբ (ժամանակակից համակարգչի գունավոր էկրանը, օրգանայզերի մոնոխրոմային էկրան, բջջային հեռախոսների կամ տեքստերի ձայնային վերարտադրման ծրագրերի կամ սարքավորումների սահմանափակ չափերով էկրան)։ Սակայն HTML-ի ժամանակակից կիրառումը հեռու է սկզբնական նշանակությունից։  </ul> </div>

			<h1><ul><ul>Browsers</ul></ul></h1>



			<div><ul>HTML լեզվով գրված ցանկացած փաստաթուղթ իրենից ներկայացնում է իրար մեջ ներդրված տարրերի հավաքածու (անգլ.՝ HTML element), ընդ որում բոլոր տարրերի սկիզբը և վերջը նշվում է հատուկ նշիչներով՝ պիտակներով (անգլ.՝ tag)։Տեքստային փաստաթղթերը, որոնք պարունակում են HTML կոդ (այդ փաստաթղթերը հիմնականում ունեն .html կամ .htm ընդլայնում), մշակվում են հատուկ ծրագրերի միջոցով, որոնք ցուցադրում են փաստաթուղթը իր ձևավորման համաձայն։ Այդ ծրագրերը, որոնք անվանում են դիտարկիչներ (անգլ.՝ browser), սովորաբար իրենցից ներկայացնում են հարմար միջավայր վեբ էջերի հայցման, դրանց դիտման և անհրաժեշտության դեպքում նաև դեպի սերվեր տվյալների փոխանցման համար։ Այժմ աշխարհում առավել գործածվող դիտարկիչներն են՝ Մոզիլա Ֆայրֆոքս, Գուգլ Քրոմ, Ինտերնետ Էքսպլորեր, Օպերա և Սաֆարի։

			1990-ական թվականի կեսերին առաջ եկավ հետևյալ երևույթը. դիտարկիչների հիմնական արտադրող ընկերությունները՝ Նեթսքեյփ (անգլ.՝ Netscape) և Մայքրոսոֆթ ((անգլ.)Microsoft), սկսեցին ներառել HTML-ը տարրերի սեպական հավաքածուներով։ Տարբեր դիտարկիչների անհամատեղելիության պատճառով ստեղվեց խառնաշփոթ, առավելապես բարդություններ էին առաջանում նույն փասթաթուղթը տարբեր դիտարկիչներում նույն տեսքով ստանալու հարցում։ Վեբ մասնագետները ստիպված էին միևնույն էջը մի քանի տարբերակով ստեղծել։ 2000-ականների սկզբին, մի քանի տարով այդ խնդիրը փոքր ինչ կորցրեց իր հրատապությունը՝ կապված Ինտերնետ Էքսպլորերի տարածման և զարգացնամ հետ։ </ul> </div>

			   	 


			   </div>
		       <?php include('footer.php') ?>
		</div>
	</body>
</html>